WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDuration_Client_Request-10.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDuration</a:Action>
    <a:MessageID>urn:uuid:1ae81f46-7f43-4eb7-a1fe-a3b0677b8a78</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDuration xmlns="http://tempuri.org/">
      <inTimeSpan>-P10675199DT2H48M5.4775808S</inTimeSpan>
    </RetDuration>
  </s:Body>
</s:Envelope>